app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("username", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["username", "After_posts_new"], ["created_at", "2018-06-20 03:55:20.102807"], ["updated_at", "2018-06-20 03:55:20.102807"], ["user_id", 1]]